<template>
    <div class="quotes">
        <h3>Введите текст для поиск по нему цитат</h3>
        <input
            class="form-control form-control-lg"
            type="text"
            v-model="searchText"
            placeholder="Жизнь"
        />
        <div class="quotes__container">
            <Quote
                v-for="quote in quotes"
                :key="quote.id"
                :text="quote.text"
                :author="quote.author"
                :search-text="searchText"
                v-show="getVisibility(quote.text)"
            />
        </div>
    </div>
</template>

<script>
import { ref } from 'vue';
import Quote from './Quote.vue';

export default {
    name: 'MyDirective',
    components: {
        Quote
    },
    setup() {
        const searchText = ref('');

        const getVisibility = (text) => {
            return searchText.value === '' || 
                   text.toLowerCase().includes(searchText.value.toLowerCase());
        };

        const quotes = ref([
                {
                    id: 1,
                    text: 'Настойчивость очень важна. Вы не должны сдаваться, если только не вынуждены сдаться.',
                    author: 'Илон Маск',
                },
                {
                    id: 2,
                    text: 'Проблемы — это спрятанные решения.',
                    author: 'Павел Дуров',
                },
                {
                    id: 3,
                    text: 'Если вы не желаете слышать критику, пожалуйста, не делайте ничего нового.',
                    author: 'Джефф Безос',
                },
                {
                    id: 4,
                    text: 'Если вы предпринимаете только те действия, результат которых известен вам заранее, долго ваш бизнес не протянет.',
                    author: 'Джефф Безос',
                },
                {
                    id: 5,
                    text: 'В мире, который меняется очень быстро, единственная стратегия, которая гарантированно провальна — не рисковать',
                    author: 'Марк Цукерберг',
                },
                {
                    id: 6,
                    text: ' Если бы я мог прожить жизнь заново, я был бы сантехником.',
                    author: 'Альберт Эйнштейн',
                },
                {
                    id: 7,
                    text: 'Ты не несешь ответственности за то, чего ждут от тебя другие люди. Если от тебя ждут слишком многого, то это их ошибка, а не твоя вина.',
                    author: 'Ричард Фейнман',
                },
                {
                    id: 8,
                    text: 'Если вы ученый, квантовый физик и не можете в двух словах объяснить пятилетнему ребенку, чем вы занимаетесь, — вы шарлатан',
                    author: 'Ричард Фейнман',
                },
                {
                    id: 9,
                    text: 'Мне всегда нравилось преуспевать в том, что у меня никак не должно было получиться.',
                    author: 'Ричард Фейнман',
                },
                {
                    id: 10,
                    text: 'В жизни нет ничего, чего стоило бы бояться, есть только то, что нужно понять.',
                    author: 'Мария Кюри-Склодовская',
                },
                {
                    id: 11,
                    text: 'Мне кажется, каждый призван заниматься одним делом на Земле.',
                    author: 'Жан-Поль Бельмондо',
                },
                {
                    id: 12,
                    text: 'Важно помнить: всякий раз, когда ты покупаешь что-то, ты на сто процентов поддерживаешь политику той компании, которая произвела эту вещь.',
                    author: 'Леонардо Ди Каприо',
                },
                {
                    id: 13,
                    text: 'Деньги — странная вещь. Люди, которые не имеют их, сильно к ним стремятся. Люди, которые их имеют, имеют также много проблем.',
                    author: 'Айртон Сенна',
                },
                {
                    id: 14,
                    text: 'Никто из нас не хотел быть бас-гитаристом. В нашем представлении это был толстый парень, который играл где-то сзади.',
                    author: 'Пол Маккартни',
                },
                {
                    id: 15,
                    text: 'Я всё время что-то пишу. Потому что я помешан на мысли, что мы должны стать ещё лучше.',
                    author: 'Крис Мартин',
                },
                {
                    id: 16,
                    text: 'С тех пор прошло 80 лет и я по-прежнему задаю себе этот же вопрос. Что же такое электричество?), но не в состоянии ответить на него.',
                    author: 'Никола Тесла',
                },

            ]);

        return {
            searchText,
            getVisibility,
            quotes
        };
    },
};
</script>
