<template>
    <div class="quotes">
        <h3>Введите текст для поиск по нему цитат</h3>
        <input
            class="form-control form-control-lg"
            placeholder="Жизнь"
            type="text"
            v-model="searchText"
        >
        <div class="quotes__container">
            <div
                v-for="(quote, index) in quotes"
                :key="index"
                class="quotes__quote-block"
                v-show="getVisibility(quote.text)"
            >
                <div
                    class="quotes__quote-text"
                    v-replace="searchText"
                >
                    "{{ quote.text }}"
                </div>
                <div class="quotes__quote-author">
                    (c) {{ quote.author }}
                </div>
            </div>
        </div>
    </div>
</template>

<script>
import vReplace from './vReplace.js';

export default {
    name: 'MyDirective',
    directives: {
        replace: vReplace,
    },
    data() {
        return {
            searchText: '',
            quotes: [
                { text: 'Настойчивость очень важна. Вы не должны сдаваться, если только не вынуждены сдаться.', author: 'Илон Маск' },
                { text: 'Проблемы — это спрятанные решения.', author: 'Павел Дуров' },
                { text: 'Если вы не желаете слышать критику, пожалуйста, не делайте ничего нового.', author: 'Джефф Безос' },
                { text: 'Если вы предпринимаете только те действия, результат которых известен вам заранее, долго ваш бизнес не протянет.', author: 'Джефф Безос' },
                { text: 'В мире, который меняется очень быстро, единственная стратегия, которая гарантированно провальна — не рисковать', author: 'Марк Цукерберг' },
                { text: ' Если бы я мог прожить жизнь заново, я был бы сантехником.', author: 'Альберт Эйнштейн' },
                { text: 'Ты не несешь ответственности за то, чего ждут от тебя другие люди. Если от тебя ждут слишком многого, то это их ошибка, а не твоя вина.', author: 'Ричард Фейнман' },
                { text: 'Если вы ученый, квантовый физик и не можете в двух словах объяснить пятилетнему ребенку, чем вы занимаетесь, — вы шарлатан', author: 'Ричард Фейнман' },
                { text: 'Мне всегда нравилось преуспевать в том, что у меня никак не должно было получиться.', author: 'Ричард Фейнман' },
                { text: 'В жизни нет ничего, чего стоило бы бояться, есть только то, что нужно понять.', author: 'Мария Кюри-Склодовская' },
                { text: 'Мне кажется, каждый призван заниматься одним делом на Земле.', author: 'Жан-Поль Бельмондо' },
                { text: 'Важно помнить: всякий раз, когда ты покупаешь что-то, ты на сто процентов поддерживаешь политику той компании, которая произвела эту вещь.', author: 'Леонардо Ди Каприо' },
                { text: 'Деньги — странная вещь. Люди, которые не имеют их, сильно к ним стремятся. Люди, которые их имеют, имеют также много проблем.', author: 'Айртон Сенна' },
                { text: 'Никто из нас не хотел быть бас-гитаристом. В нашем представлении это был толстый парень, который играл где-то сзади.', author: 'Пол Маккартни' },
                { text: 'Я всё время что-то пишу. Потому что я помешан на мысли, что мы должны стать ещё лучше.', author: 'Крис Мартин' },
                { text: 'С тех пор прошло 80 лет и я по-прежнему задаю себе этот же вопрос. Что же такое электричество?), но не в состоянии ответить на него.', author: 'Никола Тесла' },
            ],
        };
    },
    methods: {
        getVisibility(text) {
            if (!this.searchText) {
                return true;
            }
            return text.toLowerCase().includes(this.searchText.toLowerCase());
        },
    },
};
</script>
